luweixuancl/esp32-gnss-ntp/src/gps_service.cpp
#include "gps_service.h"
#include "ext_clock.h"
#include <esp_timer.h>
#include <stdlib.h>
#include <string.h>
// Arduino-ESP32 3.x / IDF 5: temperatureRead() covers C3 + S3 (legacy
// driver/temp_sensor.h removed). RMT RX uses the new driver/rmt_rx.h API.
#if GPS_PPS_RMT_EN
#include "driver/rmt_rx.h"
#include "driver/gpio.h"
#include "esp_private/rmt.h"
#include <soc/soc_caps.h>
#include <freertos/queue.h>
#endif

portMUX_TYPE GpsService::ppsMux_ = portMUX_INITIALIZER_UNLOCKED;
volatile uint32_t GpsService::ppsCount_ = 0;
volatile uint64_t GpsService::ppsLastEdgeUs_ = 0;
volatile uint8_t GpsService::ppsQHead_ = 0;
volatile uint8_t GpsService::ppsQTail_ = 0;
volatile GpsService::PpsIsrEdge GpsService::ppsQ_[GPS_PPS_ISR_QUEUE] = {};
TaskHandle_t GpsService::timeTask_ = nullptr;

// --- RMT RX hardware capture (docs/s3_deep_dive_roadmap.md #1) -----------
// IDF5 rmt_rx samples the pad at GPS_PPS_RMT_TICK_NS resolution. Each
// receive-done delivers hardware-measured symbols so the edge time is
// reconstructed as cb_entry - trailing_length — immune to GPIO-ISR latency.
// GPIO ISR stays attached; loop() merges by edge count and records deltas.
#if GPS_PPS_RMT_EN
struct RmtPpsEdge {
  uint64_t edgeUs;
  uint32_t count;
  uint32_t widthUs;
};
struct RmtPpsState {
  bool armed = false;   // first rmt_receive ok (deferred until GPIO PPS)
  bool ready = false;   // channel+task enabled; waiting for first PPS to arm
  bool alive = false;   // refinements still flowing
  bool active = false;  // currently the merge source
  bool reportedFallback = false;  // one log line per fallback episode
  uint64_t lastEdgeUs = 0;
  uint32_t lastArmTryMs = 0;
  uint8_t head = 0, tail = 0;
  RmtPpsEdge q[GPS_PPS_RMT_QUEUE];
  // statistics (task-context writers only)
  uint32_t samples = 0;
  int64_t deltaSumUx10 = 0;
  int32_t deltaMinUs = 0;
  int32_t deltaMaxUs = 0;
  uint32_t oddPulse = 0;
  uint32_t fallbacks = 0;
  uint32_t lastWidthUs = 0;
};
static RmtPpsState gRmt;

// IDF5 driver state: channel handle + done-queue of *copied* frames.
// v1.1.29 board fail mode: queueing edata pointers under DMA left the task
// reading 1×zero-duration symbols (stale buffer). Always copy in the ISR.
// v1.1.33: native mem block (48 words/ch on S3); dual RX buffers; raw hex dump.
#ifndef GPS_PPS_RMT_SYM_CAP
#define GPS_PPS_RMT_SYM_CAP SOC_RMT_MEM_WORDS_PER_CHANNEL
#endif
struct RmtDoneFrame {
  size_t n = 0;
  rmt_symbol_word_t syms[GPS_PPS_RMT_SYM_CAP];
};
struct IdfPpsState {
  bool ok = false;
  uint8_t stage = 0;  // 1=new_ch 2=cbs 4=enable 8=task 16=recv
  int err = 0;
  uint32_t frames = 0;
  uint32_t firstSyms = 0;
  uint32_t lastSyms = 0;
  uint32_t lastD0Us = 0;
  uint32_t lastD1Us = 0;
  uint32_t lastRawVal = 0;
  uint32_t emptyFrames = 0;
  uint32_t dataFrames = 0;
  uint32_t junkFrames = 0;
  uint32_t dumpLeft = GPS_PPS_RMT_DUMP_FRAMES;
  uint8_t rawIdx = 0;
  rmt_channel_handle_t chan = nullptr;
  QueueHandle_t doneQ = nullptr;
  rmt_symbol_word_t raw[2][GPS_PPS_RMT_SYM_CAP];
  rmt_receive_config_t recvCfg = {};
};
static IdfPpsState gIdf;
#endif

static bool boardTempBegin() {
  // temperatureRead() lazily initialises the tsens driver; gate on a
  // plausible reading. sampleDieTemp() retries this probe every 5 s when it
  // fails, so a transiently bad first read no longer disables temperature.
  float c = temperatureRead();
  const bool ok = !isnan(c) && c > -20.0f && c < 85.0f;
  return ok;
}
static bool boardTempRead(float* out) {
  float c = temperatureRead();
  if (isnan(c) || c <= -20.0f || c >= 85.0f) {
    return false;
  }
  *out = c;
  return true;
}

void IRAM_ATTR GpsService::onPpsIsr() {
  const uint64_t edgeUs = esp_timer_get_time();
  portENTER_CRITICAL_ISR(&ppsMux_);
  const uint32_t count = ppsCount_ + 1;
  ppsCount_ = count;
  ppsLastEdgeUs_ = edgeUs;

  const uint8_t next = static_cast<uint8_t>((ppsQHead_ + 1) % GPS_PPS_ISR_QUEUE);
  if (next == ppsQTail_) {
    // Drop oldest so newest edges survive under load.
    ppsQTail_ = static_cast<uint8_t>((ppsQTail_ + 1) % GPS_PPS_ISR_QUEUE);
  }
  ppsQ_[ppsQHead_].edgeUs = edgeUs;
  ppsQ_[ppsQHead_].count = count;
  ppsQHead_ = next;
  portEXIT_CRITICAL_ISR(&ppsMux_);

  BaseType_t woken = pdFALSE;
  if (timeTask_ != nullptr) {
    vTaskNotifyGiveFromISR(timeTask_, &woken);
  }
  if (woken) {
    portYIELD_FROM_ISR();
  }
}

// HAL delivers frames from a normal TASK context (_rmtRxTask), not an ISR:
// plain critical-section/notify APIs are the correct ones here. A frame is
// ~one second of symbols ([low gap][pulse][trailing low]) split at the idle
// threshold, so the edge must be located by the LAST 0->1 transition in the
// frame — reconstructing from the total frame length would land ~one second
// early (the ACQ-oscillation bug of the first attempt).
bool GpsService::rmtProcessSymbols(const uint32_t* data, size_t len) {
#if GPS_PPS_RMT_EN
  if (data == nullptr || len == 0) {
    return false;
  }
  const uint64_t nowUs = esp_timer_get_time();

  // Walk the symbol halves in order; remember where the last rising edge
  // starts and the length of the high run after it (the pulse may span
  // several symbols: one symbol caps at 32767 ticks = ~32.8 ms @1 µs).
  uint64_t cumNs = 0;
  uint64_t riseNs = 0;
  uint64_t widthNs = 0;
  bool haveEdge = false;
  int prevLevel = 0;
  for (size_t i = 0; i < len; ++i) {
    const uint32_t sym = data[i];
    const uint32_t durs[2] = {sym & 0x7FFF, (sym >> 16) & 0x7FFF};
    const int levels[2] = {static_cast<int>((sym >> 15) & 1),
                           static_cast<int>((sym >> 31) & 1)};
    for (int h = 0; h < 2; ++h) {
      if (durs[h] == 0) {
        continue;
      }
      const uint64_t dNs = static_cast<uint64_t>(durs[h]) * GPS_PPS_RMT_TICK_NS;
      if (prevLevel == 0 && levels[h] == 1) {
        riseNs = cumNs;
        widthNs = 0;
        haveEdge = true;
      }
      if (levels[h] == 1 && haveEdge) {
        widthNs += dNs;
      }
      cumNs += dNs;
      prevLevel = levels[h];
    }
  }
  if (!haveEdge) {
    return false;
  }
  const uint32_t widthUs = static_cast<uint32_t>(widthNs / 1000);
  const uint64_t edgeUs = nowUs - ((cumNs - riseNs) / 1000);
  // Sanity gates: a valid PPS edge happened recently and its pulse is
  // plausible; anything else is a malformed frame — drop, never poison.
  if (widthUs < 10000 || widthUs > 500000) {
    portENTER_CRITICAL(&ppsMux_);
    ++gRmt.oddPulse;
    portEXIT_CRITICAL(&ppsMux_);
    return false;
  }
  if (nowUs - edgeUs > 1500000ULL) {
    return false;  // reconstructed edge older than 1.5 s: malformed frame
  }

