luweixuancl/esp32-gnss-ntp/src/gps_service.cpp
  portENTER_CRITICAL(&ppsMux_);
  const uint32_t count = ppsCount_;  // GPIO ISR owns edge counting
  const uint8_t next = static_cast<uint8_t>((gRmt.head + 1) % GPS_PPS_RMT_QUEUE);
  if (next != gRmt.tail) {
    gRmt.q[gRmt.head].edgeUs = edgeUs;
    gRmt.q[gRmt.head].count = count;
    gRmt.q[gRmt.head].widthUs = widthUs;
    gRmt.head = next;
  }
  gRmt.lastEdgeUs = nowUs;
  gRmt.alive = true;
  gRmt.lastWidthUs = widthUs;
  portEXIT_CRITICAL(&ppsMux_);

  if (timeTask_ != nullptr) {
    xTaskNotifyGive(timeTask_);
  }
  return true;
#else
  (void)data;
  (void)len;
  return false;
#endif
}

#if GPS_PPS_RMT_EN
// IDF5 on_recv_done runs in ISR: copy symbols out of the driver buffer before
// returning (DMA/ping-pong may recycle the memory immediately after).
bool IRAM_ATTR GpsService::rmtRxDoneCb(rmt_channel_handle_t channel,
                                       const rmt_rx_done_event_data_t* edata,
                                       void* user_data) {
  (void)channel;
  (void)user_data;
  if (edata == nullptr || gIdf.doneQ == nullptr) {
    return false;
  }
  RmtDoneFrame fr{};
  size_t n = edata->num_symbols;
  if (n > GPS_PPS_RMT_SYM_CAP) {
    n = GPS_PPS_RMT_SYM_CAP;
  }
  fr.n = n;
  // Word-by-word copy (avoid memcpy in ISR / cache-safe builds).
  if (n > 0 && edata->received_symbols != nullptr) {
    for (size_t i = 0; i < n; ++i) {
      fr.syms[i].val = edata->received_symbols[i].val;
    }
  }
  BaseType_t woken = pdFALSE;
  if (xQueueSendFromISR(gIdf.doneQ, &fr, &woken) != pdTRUE) {
    return false;
  }
  return woken == pdTRUE;
}

bool GpsService::rmtArmReceive() {
  if (gIdf.chan == nullptr) {
    return false;
  }
  gIdf.rawIdx = static_cast<uint8_t>(1u - gIdf.rawIdx);
  rmt_symbol_word_t* buf = gIdf.raw[gIdf.rawIdx];
  const esp_err_t err = rmt_receive(gIdf.chan, buf, GPS_PPS_RMT_SYM_CAP * sizeof(rmt_symbol_word_t),
                                    &gIdf.recvCfg);
  if (err != ESP_OK) {
    gIdf.err = err;
    return false;
  }
  gIdf.stage |= 16;
  return true;
}

void GpsService::tryArmRmtAfterFirstPps() {
  if (!gRmt.ready || gRmt.armed || !gIdf.ok) {
    return;
  }
  // GNSS modules do not emit 1PPS until they have time/fix; keep GPIO-only
  // until the ISR has seen at least one edge, then start RMT receive.
  if (!ppsSeen_ && ppsCount_ == 0) {
    return;
  }
  const uint32_t nowMs = millis();
  if (gRmt.lastArmTryMs != 0 && (nowMs - gRmt.lastArmTryMs) < GPS_PPS_RMT_ARM_RETRY_MS) {
    return;
  }
  gRmt.lastArmTryMs = nowMs;
  if (rmtArmReceive()) {
    gRmt.armed = true;
    Serial.printf("[pps-rmt] idf5 armed after first PPS (count=%u)\n",
                  static_cast<unsigned>(ppsCount_));
  } else {
    Serial.printf("[pps-rmt] arm defer failed err=%d (retry)\n", gIdf.err);
  }
}

// Task-context RX: drain copied frames → symbol parser → re-arm receive.
void GpsService::rmtRxTask(void* arg) {
  (void)arg;
  for (;;) {
    RmtDoneFrame fr{};
    if (xQueueReceive(gIdf.doneQ, &fr, portMAX_DELAY) != pdTRUE) {
      continue;
    }
    ++gIdf.frames;
    const size_t n = fr.n;
    if (n == 0) {
      ++gIdf.emptyFrames;
    } else {
      if (gIdf.firstSyms == 0) {
        gIdf.firstSyms = static_cast<uint32_t>(n);
      }
      gIdf.lastSyms = static_cast<uint32_t>(n);
      const rmt_symbol_word_t& s0 = fr.syms[0];
      gIdf.lastRawVal = s0.val;
      gIdf.lastD0Us = static_cast<uint32_t>(s0.duration0) * (GPS_PPS_RMT_TICK_NS / 1000);
      gIdf.lastD1Us = static_cast<uint32_t>(s0.duration1) * (GPS_PPS_RMT_TICK_NS / 1000);
      if (gIdf.dumpLeft > 0) {
        --gIdf.dumpLeft;
        // Executor-requested: raw 32-bit word(s) to distinguish all-zero vs bitfield skew.
        Serial.printf("[pps-rmt] dump n=%u val0=0x%08lx d0=%u l0=%u d1=%u l1=%u",
                      static_cast<unsigned>(n),
                      static_cast<unsigned long>(s0.val),
                      static_cast<unsigned>(s0.duration0),
                      static_cast<unsigned>(s0.level0),
                      static_cast<unsigned>(s0.duration1),
                      static_cast<unsigned>(s0.level1));
        if (n > 1) {
          Serial.printf(" val1=0x%08lx", static_cast<unsigned long>(fr.syms[1].val));
        }
        Serial.println();
      }
      if (rmtProcessSymbols(reinterpret_cast<const uint32_t*>(fr.syms), n)) {
        ++gIdf.dataFrames;
      } else {
        ++gIdf.junkFrames;
      }
    }
    (void)rmtArmReceive();
  }
}
#endif

void GpsService::begin() {
  localClock_.reset();
  pinMode(PIN_GPS_PPS, INPUT_PULLDOWN);
  gpsSerial_.setRxBufferSize(2048);
  gpsSerial_.begin(GPS_UART_BAUD, SERIAL_8N1, PIN_GPS_RX, PIN_GPS_TX);
#if GPS_PPS_RMT_EN
  {
    // Claim the pad for RMT *before* Arduino attachInterrupt so the GPIO
    // matrix RX route is established first (v1.1.33).
    // signal_range_max_ns is 15-bit in tick units → max 32767 * tick_ns.
    gIdf.doneQ = xQueueCreate(4, sizeof(RmtDoneFrame));
    gIdf.recvCfg.signal_range_min_ns = GPS_PPS_RMT_FILTER_NS;
    {
      const uint32_t tickNs = GPS_PPS_RMT_TICK_NS;
      const uint32_t maxRangeNs = 32767u * tickNs;  // IDF5 rmt_receive hard cap
      uint32_t rangeNs =
          static_cast<uint32_t>(GPS_PPS_RMT_WINDOW_MS) * 1000000UL;
      if (rangeNs > maxRangeNs) {
        rangeNs = maxRangeNs;
      }
      gIdf.recvCfg.signal_range_max_ns = rangeNs;
    }
    gIdf.recvCfg.flags.en_partial_rx = 0;

    rmt_rx_channel_config_t cfg = {};
    cfg.gpio_num = static_cast<gpio_num_t>(PIN_GPS_PPS);
    cfg.clk_src = RMT_CLK_SRC_DEFAULT;
    cfg.resolution_hz = 1000000000UL / GPS_PPS_RMT_TICK_NS;  // 1 MHz @ 1 µs
    // Native S3 channel depth (48). Requesting 64 forced a 2-block invade.
    cfg.mem_block_symbols = GPS_PPS_RMT_SYM_CAP;
    cfg.intr_priority = 0;
    cfg.flags.with_dma = 0;  // copy-safe; S3 DMA optional later

    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (gIdf.doneQ == nullptr) {
      err = ESP_ERR_NO_MEM;
    } else {
      err = rmt_new_rx_channel(&cfg, &gIdf.chan);
    }
    if (err == ESP_OK) {
      gIdf.stage |= 1;
      rmt_rx_event_callbacks_t cbs = {};
      cbs.on_recv_done = &GpsService::rmtRxDoneCb;
      err = rmt_rx_register_event_callbacks(gIdf.chan, &cbs, nullptr);
    }
    if (err == ESP_OK) {
      gIdf.stage |= 2;
      err = rmt_enable(gIdf.chan);
    }
    if (err == ESP_OK) {
      gIdf.stage |= 4;
      if (xTaskCreate(rmtRxTask, "rmtpps", 3072, nullptr, 3, nullptr) == pdPASS) {
        gIdf.stage |= 8;
      } else {
        err = ESP_ERR_NO_MEM;
      }
    }
    if (err == ESP_OK) {
      // Driver enables pull-up; PPS line is idle-low — restore pulldown.
      gpio_pullup_dis(static_cast<gpio_num_t>(PIN_GPS_PPS));
      gpio_pulldown_en(static_cast<gpio_num_t>(PIN_GPS_PPS));
      // Do NOT rmt_receive yet: PPS pin is idle-low until GNSS has a fix.
      // Arm on first GPIO PPS from loop() (see tryArmRmtAfterFirstPps).
      gIdf.ok = true;
      gRmt.ready = true;
      uint32_t realHz = 0;
      int chId = -1;
      (void)rmt_get_channel_resolution(gIdf.chan, &realHz);
      (void)rmt_get_channel_id(gIdf.chan, &chId);
      Serial.printf("[pps-rmt] idf5 ready pin=%d tick=%uns win=%ums filter=%uns dma=%u "
                    "mem=%u ch=%d realHz=%lu (arm on first PPS)\n",
                    PIN_GPS_PPS, GPS_PPS_RMT_TICK_NS, GPS_PPS_RMT_WINDOW_MS,
                    GPS_PPS_RMT_FILTER_NS, static_cast<unsigned>(cfg.flags.with_dma),
                    static_cast<unsigned>(GPS_PPS_RMT_SYM_CAP), chId,
                    static_cast<unsigned long>(realHz));
    } else {
      gIdf.err = err;
      Serial.printf("[pps-rmt] idf5 init failed stage=%u err=%d -> GPIO ISR only\n",
                    gIdf.stage, gIdf.err);
    }
  }
#endif
  // GPIO ISR after RMT matrix connect so both can share the pad.
  attachInterrupt(digitalPinToInterrupt(PIN_GPS_PPS), onPpsIsr, RISING);
  Serial.printf("GPS UART%d RX=%d TX=%d baud=%d buf=2048 local-clock=on ppsQ=%d tsens=%d\n",
                GPS_UART_NUM, PIN_GPS_RX, PIN_GPS_TX, GPS_UART_BAUD, GPS_PPS_ISR_QUEUE,
                tempSensorOk_ ? 1 : 0);
#if GPS_NMEA_FILTER_EN
  probeAndFilterNmea();
#endif
}

uint8_t GpsService::nmeaChecksum(const char* body) {
  uint8_t cs = 0;
  for (const char* p = body; p && *p; ++p) {
    cs ^= static_cast<uint8_t>(*p);
  }
  return cs;
}

