luweixuancl/esp32-gnss-ntp/src/gps_service.cpp
void GpsService::sendPcas(const char* bodyNoDollar) {
  if (bodyNoDollar == nullptr) {
    return;
  }
  const uint8_t cs = nmeaChecksum(bodyNoDollar);
  char frame[96];
  snprintf(frame, sizeof(frame), "$%s*%02X\r\n", bodyNoDollar, cs);
  gpsSerial_.print(frame);
  Serial.printf("[gps] TX %s", frame);
}

uint32_t GpsService::civilToEpoch(int year, int month, int day, int hour, int minute, int second) {
  int y = year;
  int m = month;
  if (m <= 2) {
    y -= 1;
    m += 12;
  }
  const int64_t a = y / 100;
  const int64_t b = 2 - a + a / 4;
  const int64_t jd = static_cast<int64_t>(365.25 * (y + 4716)) +
                     static_cast<int64_t>(30.6001 * (m + 1)) + day + b - 1524;
  const int64_t daysSinceUnix = jd - 2440588;
  return static_cast<uint32_t>(daysSinceUnix * 86400LL + hour * 3600L + minute * 60L + second);
}

void GpsService::feedNmeaChar(char c) {
  gps_.encode(c);
  if (c == '$') {
    nmeaLineLen_ = 0;
    nmeaLine_[nmeaLineLen_++] = c;
    return;
  }
  if (c == '\r' || c == '\n') {
    if (nmeaLineLen_ >= 6) {
      nmeaLine_[nmeaLineLen_] = '\0';
      onNmeaLine(nmeaLine_);
    }
    nmeaLineLen_ = 0;
    return;
  }
  if (nmeaLineLen_ > 0 && nmeaLineLen_ + 1 < sizeof(nmeaLine_)) {
    nmeaLine_[nmeaLineLen_++] = c;
  } else if (nmeaLineLen_ + 1 >= sizeof(nmeaLine_)) {
    nmeaLineLen_ = 0;
  }
}

void GpsService::onNmeaLine(const char* line) {
  if (line == nullptr || line[0] != '$' || strlen(line) < 6) {
    return;
  }
  // "$xxTTT,..." → sentence type at [3..5]
  const char t0 = line[3];
  const char t1 = line[4];
  const char t2 = line[5];
  if (t0 == 'G' && t1 == 'G' && t2 == 'A') {
    nmeaSeenMask_ |= 1u << 0;
  } else if (t0 == 'G' && t1 == 'L' && t2 == 'L') {
    nmeaSeenMask_ |= 1u << 1;
  } else if (t0 == 'G' && t1 == 'S' && t2 == 'A') {
    nmeaSeenMask_ |= 1u << 2;
  } else if (t0 == 'G' && t1 == 'S' && t2 == 'V') {
    nmeaSeenMask_ |= 1u << 3;
  } else if (t0 == 'R' && t1 == 'M' && t2 == 'C') {
    nmeaSeenMask_ |= 1u << 4;
  } else if (t0 == 'V' && t1 == 'T' && t2 == 'G') {
    nmeaSeenMask_ |= 1u << 5;
  } else if (t0 == 'Z' && t1 == 'D' && t2 == 'A') {
    nmeaSeenMask_ |= 1u << 6;
    parseZdaLine(line);
  }
}

bool GpsService::parseZdaLine(const char* line) {
  // $--ZDA,hhmmss.ss,dd,mm,yyyy,ltzh,ltzm*CS
  char buf[96];
  strncpy(buf, line, sizeof(buf) - 1);
  buf[sizeof(buf) - 1] = '\0';
  char* star = strchr(buf, '*');
  if (star) {
    *star = '\0';
  }

  char* save = nullptr;
  char* tok = strtok_r(buf, ",", &save);  // $xxZDA
  if (tok == nullptr) {
    return false;
  }
  tok = strtok_r(nullptr, ",", &save);  // time
  if (tok == nullptr || strlen(tok) < 6) {
    return false;
  }
  const int hour = (tok[0] - '0') * 10 + (tok[1] - '0');
  const int minute = (tok[2] - '0') * 10 + (tok[3] - '0');
  const int second = (tok[4] - '0') * 10 + (tok[5] - '0');
  tok = strtok_r(nullptr, ",", &save);  // day
  if (tok == nullptr || *tok == '\0') {
    return false;
  }
  const int day = atoi(tok);
  tok = strtok_r(nullptr, ",", &save);  // month
  if (tok == nullptr || *tok == '\0') {
    return false;
  }
  const int month = atoi(tok);
  tok = strtok_r(nullptr, ",", &save);  // year
  if (tok == nullptr || *tok == '\0') {
    return false;
  }
  const int year = atoi(tok);
  if (year < 2000 || month < 1 || month > 12 || day < 1 || day > 31 || hour > 23 ||
      minute > 59 || second > 60) {
    return false;
  }
  zdaEpoch_ = civilToEpoch(year, month, day, hour, minute, second);
  zdaMs_ = millis();
  zdaValid_ = true;
  return true;
}

void GpsService::probeAndFilterNmea() {
  nmeaSeenMask_ = 0;
  nmeaLineLen_ = 0;
  const uint32_t start = millis();
  Serial.printf("[gps] probing NMEA ≤%u ms...\n", static_cast<unsigned>(GPS_NMEA_PROBE_MS));
  while ((millis() - start) < GPS_NMEA_PROBE_MS) {
    while (gpsSerial_.available() > 0) {
      feedNmeaChar(static_cast<char>(gpsSerial_.read()));
    }
    delay(5);
  }

  char seen[48] = {};
  size_t n = 0;
  auto append = [&](const char* s) {
    if (n > 0 && n + 1 < sizeof(seen)) {
      seen[n++] = ',';
    }
    while (*s && n + 1 < sizeof(seen)) {
      seen[n++] = *s++;
    }
    seen[n] = '\0';
  };
  if (nmeaSeenMask_ & (1u << 0)) {
    append("GGA");
  }
  if (nmeaSeenMask_ & (1u << 1)) {
    append("GLL");
  }
  if (nmeaSeenMask_ & (1u << 2)) {
    append("GSA");
  }
  if (nmeaSeenMask_ & (1u << 3)) {
    append("GSV");
  }
  if (nmeaSeenMask_ & (1u << 4)) {
    append("RMC");
  }
  if (nmeaSeenMask_ & (1u << 5)) {
    append("VTG");
  }
  if (nmeaSeenMask_ & (1u << 6)) {
    append("ZDA");
  }
  if (n == 0) {
    Serial.println("[gps] probe: no NMEA yet (module waking?) — apply RAM filter only");
  } else {
    Serial.printf("[gps] probe saw: %s\n", seen);
  }

  // Want GGA + RMC + ZDA. RMC backs TinyGPS date/time; ZDA is preferred when
  // present. Strip GLL/GSA/GSV/VTG noise. (GGA-only+ZDA without RMC was a
  // lock failure mode when ZDA did not flow after PCAS.)
  constexpr uint16_t kWant =
      (1u << 0) | (1u << 4) | (1u << 6);  // GGA | RMC | ZDA
  constexpr uint16_t kExtras =
      (1u << 1) | (1u << 2) | (1u << 3) | (1u << 5);  // GLL|GSA|GSV|VTG
  const bool alreadyOk =
      n > 0 && (nmeaSeenMask_ & kWant) == kWant && (nmeaSeenMask_ & kExtras) == 0;
  if (alreadyOk) {
    nmeaFilterApplied_ = true;
    Serial.println("[gps] NMEA filter: already GGA+RMC+ZDA — skip PCAS (no FLASH write)");
    return;
  }

  // CASIC PCAS03: GGA,GLL,GSA,GSV,RMC,VTG,ZDA,...
  sendPcas("PCAS03,1,0,0,0,1,0,1,0,0,0,,,0,0");
  delay(GPS_NMEA_CMD_GAP_MS);

  // Persist only when probe observed a wrong/incomplete set. Empty probe →
  // RAM-only this boot (avoid FLASH wear while the module is still waking).
  const bool shouldPersist =
      n > 0 && ((nmeaSeenMask_ & kExtras) != 0 || (nmeaSeenMask_ & kWant) != kWant);
  if (shouldPersist) {
    sendPcas("PCAS00");  // save to module FLASH once
    delay(GPS_NMEA_CMD_GAP_MS);
    Serial.println("[gps] NMEA filter: GGA+RMC+ZDA (saved)");
  } else {
    Serial.println("[gps] NMEA filter: GGA+RMC+ZDA (RAM, not saved)");
  }
  nmeaFilterApplied_ = true;
}

void GpsService::setTempComp(bool enabled, int16_t coeffCenti) {
  localClock_.setTempComp(enabled, coeffCenti);
}


void GpsService::sampleDieTemp() {
  if (!tempSensorOk_) {
    // Lazy re-arm: the first temperatureRead() after boot can transiently
    // return a bad value on S3; retry the probe every 5 s instead of
    // killing temperature for the whole power cycle.
    const uint32_t nowMs = millis();
    if (lastTempTryMs_ != 0 && (nowMs - lastTempTryMs_) < 5000) {
      return;
    }
    lastTempTryMs_ = nowMs;
    tempSensorOk_ = boardTempBegin();
    if (tempSensorOk_) {
      Serial.println("[gps] tsens probe recovered");
    }
    return;
  }
  const uint32_t now = millis();
  if (lastTempMs_ != 0 && (now - lastTempMs_) < CLK_TEMP_SAMPLE_MS) {
    return;
  }
  lastTempMs_ = now;
  float c = NAN;
  if (boardTempRead(&c)) {
    localClock_.updateDieTemp(c);
  }
}

