luweixuancl/esp32-gnss-ntp/src/gps_service.cpp
void GpsService::loop(AnomalyPolicy policy, uint16_t holdoverSec) {
  sampleDieTemp();
  parseNmea();

#if GPS_PPS_RMT_EN
  tryArmRmtAfterFirstPps();
#endif

  // Drain every queued PPS edge (WiFi may delay task-time by >1s). With RMT
  // capture armed, GPIO edges are held briefly until their refined hardware
  // timestamp arrives (keyed by count); per-edge timeout falls back to the
  // GPIO timestamp. Delta statistics quantify the RMT gain (roadmap #1).
  uint32_t drainedCount = 0;
#if GPS_PPS_RMT_EN
  struct GpioPending {
    uint64_t edgeUs;
    uint32_t count;
    uint64_t queuedUs;
  };
  static GpioPending pend[GPS_PPS_ISR_QUEUE];
  static size_t npend = 0;
  RmtPpsEdge ref[GPS_PPS_RMT_QUEUE];
  size_t nref = 0;
  if (gRmt.armed) {
    portENTER_CRITICAL(&ppsMux_);
    while (gRmt.tail != gRmt.head && nref < GPS_PPS_RMT_QUEUE) {
      ref[nref++] = gRmt.q[gRmt.tail];
      gRmt.tail = static_cast<uint8_t>((gRmt.tail + 1) % GPS_PPS_RMT_QUEUE);
    }
    portEXIT_CRITICAL(&ppsMux_);
  }
#endif
  for (;;) {
    uint64_t edgeUs = 0;
    uint32_t count = 0;
    bool got = false;
    portENTER_CRITICAL(&ppsMux_);
    if (ppsQTail_ != ppsQHead_) {
      edgeUs = ppsQ_[ppsQTail_].edgeUs;
      count = ppsQ_[ppsQTail_].count;
      ppsQTail_ = static_cast<uint8_t>((ppsQTail_ + 1) % GPS_PPS_ISR_QUEUE);
      got = true;
    }
    portEXIT_CRITICAL(&ppsMux_);
    if (!got) {
      break;
    }
    ppsSeen_ = true;
    drainedCount = count;
#if GPS_PPS_RMT_EN
    if (gRmt.armed) {
      if (npend < GPS_PPS_ISR_QUEUE) {
        pend[npend].edgeUs = edgeUs;
        pend[npend].count = count;
        pend[npend].queuedUs = esp_timer_get_time();
        ++npend;
      } else {
        localClock_.onPpsEdge(edgeUs, count);  // pending full: emit raw
      }
      continue;
    }
#endif
    localClock_.onPpsEdge(edgeUs, count);
  }
#if GPS_PPS_RMT_EN
  if (gRmt.armed && npend != 0) {
    const uint64_t nowUs = esp_timer_get_time();
    const uint64_t holdNs = static_cast<uint64_t>(GPS_PPS_RMT_HOLD_MS) * 1000000ULL;
    size_t out = 0;
    for (size_t i = 0; i < npend; ++i) {
      int64_t refined = -1;
      size_t hit = nref;
      for (size_t k = 0; k < nref; ++k) {
        if (ref[k].count == pend[i].count) {
          refined = static_cast<int64_t>(ref[k].edgeUs);
          hit = k;
          break;
        }
        const int64_t dt =
            static_cast<int64_t>(ref[k].edgeUs) - static_cast<int64_t>(pend[i].edgeUs);
        if (dt >= -static_cast<int64_t>(GPS_PPS_RMT_MATCH_US) &&
            dt <= static_cast<int64_t>(GPS_PPS_RMT_MATCH_US)) {
          // Prefer closest in time when count drifted (DMA/race).
          if (refined < 0 ||
              llabs(dt) < llabs(refined - static_cast<int64_t>(pend[i].edgeUs))) {
            refined = static_cast<int64_t>(ref[k].edgeUs);
            hit = k;
          }
        }
      }
      if (refined >= 0) {
        localClock_.onPpsEdge(static_cast<uint64_t>(refined), pend[i].count);
        const int64_t dUs = refined - static_cast<int64_t>(pend[i].edgeUs);
        ++gRmt.samples;
        gRmt.deltaSumUx10 += dUs * 10;
        if (gRmt.samples == 1 || dUs < gRmt.deltaMinUs) gRmt.deltaMinUs = static_cast<int32_t>(dUs);
        if (gRmt.samples == 1 || dUs > gRmt.deltaMaxUs) gRmt.deltaMaxUs = static_cast<int32_t>(dUs);
        if (!gRmt.active) {
          gRmt.active = true;
          gRmt.reportedFallback = false;
        }
        if (hit < nref) {
          gRmt.lastWidthUs = ref[hit].widthUs;
        }
        drainedCount = pend[i].count;
      } else if ((nowUs - pend[i].queuedUs) > holdNs) {
        localClock_.onPpsEdge(pend[i].edgeUs, pend[i].count);  // no refinement: GPIO fallback
        // Count unrefined GPIO emits even before first active (diagnose hold misses).
        ++gRmt.fallbacks;
        if (gRmt.active) {
          gRmt.active = false;
        }
        if (!gRmt.reportedFallback) {
          Serial.println("[pps-rmt] stale -> GPIO fallback");
          gRmt.reportedFallback = true;
        }
        drainedCount = pend[i].count;
      } else {
        pend[out++] = pend[i];  // still within the capture window: keep waiting
      }
    }
    npend = out;
    // Refinements whose GPIO twin was dropped (ISR storm): feed them anyway.
    for (size_t k = 0; k < nref; ++k) {
      bool matched = false;
      for (size_t i = 0; i < npend; ++i) {
        if (pend[i].count == ref[k].count) {
          matched = true;
          break;
        }
      }
      if (!matched && ref[k].count > drainedCount) {
        localClock_.onPpsEdge(ref[k].edgeUs, ref[k].count);
        drainedCount = ref[k].count;
        ++gRmt.samples;
      }
    }
  }
#endif
  if (drainedCount != 0) {
    lastDrainedPpsCount_ = drainedCount;
  }

  GpsStatus work;
  work.satellites = gps_.satellites.isValid() ? gps_.satellites.value() : 0;
  // isValid() alone is sticky after first fix; require recent updates and sats>0 so
  // antenna-loss (0 sats / stale NMEA) clears "GPS 锁定" on OLED/Web.
  const bool locFresh =
      gps_.location.isValid() && gps_.location.age() <= GPS_FIX_MAX_AGE_MS;
  const bool zdaFresh = zdaValid_ && (millis() - zdaMs_) <= GPS_FIX_MAX_AGE_MS;
  const bool rmcTimeFresh = gps_.date.isValid() && gps_.time.isValid() &&
                            gps_.time.age() <= GPS_FIX_MAX_AGE_MS;
  const bool timeFresh = zdaFresh || rmcTimeFresh;
  const bool satsOk = gps_.satellites.isValid() &&
                      gps_.satellites.age() <= GPS_FIX_MAX_AGE_MS && work.satellites > 0;
  work.validFix = locFresh && timeFresh && satsOk;
  if (locFresh) {
    work.lat = gps_.location.lat();
    work.lon = gps_.location.lng();
  }
  if (gps_.hdop.isValid() && gps_.hdop.age() <= GPS_FIX_MAX_AGE_MS) {
    work.hdop = gps_.hdop.hdop();
  }
  work.ppsSeen = ppsSeen_;
  work.ppsCount = ppsCount_;
  work.ppsFresh = ppsFresh();
#if GPS_PPS_RMT_EN
  work.ppsRmt.ok = gRmt.armed;
  work.ppsRmt.active = gRmt.active;
  work.ppsRmt.samples = gRmt.samples;
  work.ppsRmt.deltaMeanUx10 = gRmt.samples != 0
      ? static_cast<int32_t>(gRmt.deltaSumUx10 / gRmt.samples) : 0;
  work.ppsRmt.deltaMinUs = gRmt.deltaMinUs;
  work.ppsRmt.deltaMaxUs = gRmt.deltaMaxUs;
  work.ppsRmt.oddPulse = gRmt.oddPulse;
  work.ppsRmt.fallbacks = gRmt.fallbacks;
  work.ppsRmt.lastWidthUs = gRmt.lastWidthUs;
  work.ppsRmt.idfOk = gIdf.ok;
  work.ppsRmt.idfFrames = gIdf.frames;
  work.ppsRmt.idfFirstSyms = gIdf.firstSyms;
  work.ppsRmt.idfLastSyms = gIdf.lastSyms;
  work.ppsRmt.idfLastD0Us = gIdf.lastD0Us;
  work.ppsRmt.idfLastD1Us = gIdf.lastD1Us;
  work.ppsRmt.idfEmptyFrames = gIdf.emptyFrames;
  work.ppsRmt.idfDataFrames = gIdf.dataFrames;
  work.ppsRmt.idfJunkFrames = gIdf.junkFrames;
  work.ppsRmt.idfRawStatus = gIdf.lastRawVal;
  work.ppsRmt.idfStage = gIdf.stage;
  work.ppsRmt.idfErr = gIdf.err;
#endif

  if (zdaFresh) {
    work.ageMs = millis() - zdaMs_;
    if (zdaEpoch_ != lastCommittedSecond_) {
      commitNmeaTime(zdaEpoch_, policy, holdoverSec);
      lastCommittedSecond_ = zdaEpoch_;
    }
  } else if (gps_.date.isValid() && gps_.time.isValid()) {
    TinyGPSDate d = gps_.date;
    TinyGPSTime t = gps_.time;
    const uint32_t epoch =
        civilToEpoch(d.year(), d.month(), d.day(), t.hour(), t.minute(), t.second());
    work.ageMs = gps_.time.age();
    if (epoch != lastCommittedSecond_) {
      commitNmeaTime(epoch, policy, holdoverSec);
      lastCommittedSecond_ = epoch;
    }
  } else {
    work.ageMs = 0xFFFFFFFF;
  }

  const bool nmeaFresh = haveCommit_ && (millis() - commitMs_) <= 3000;
  gExtClock.poll();
  localClock_.setExtAssist(gExtClock.healthy(), gExtClock.ppmFloorHint());
  localClock_.tick(nmeaFresh, work.ppsFresh, policy, holdoverSec);

  work.qualityMs = qualityMs();
  uint32_t sec = 0;
  uint32_t frac = 0;
  work.timeValid = nowUtc(sec, frac);
  work.utcEpoch = work.timeValid ? sec : commitEpoch_;
  work.clockState = localClock_.state();
  work.residualMs = localClock_.residualMs();
  work.freqPpm = localClock_.freqPpm();
  work.tempC = localClock_.dieTempC();
  work.tempRefC = localClock_.tempRefC();
  work.tempCorrPpm = localClock_.tempCorrPpm();
  work.tempComp = localClock_.tempCompEnabled();
  work.holdoverMs = localClock_.holdoverElapsedMs();
  work.extClockEnabled = gExtClock.enabled();
  work.extClockHealthy = gExtClock.healthy();
  work.extClockPpmFloor = gExtClock.ppmFloorHint();
  work.extClockTempC = gExtClock.dieTempC();
  work.extClockDriver = gExtClock.driver();

  publishStatus(work);

#if GPS_LOCK_DIAG_MS > 0
  if (!work.timeValid) {
    static uint32_t lastDiagMs = 0;
    const uint32_t nowDiag = millis();
    if (lastDiagMs == 0 || (nowDiag - lastDiagMs) >= GPS_LOCK_DIAG_MS) {
      lastDiagMs = nowDiag;
      Serial.printf(
          "[clk] wait tv=0 clk=%s pps=%u fresh=%d nmea=%d zda=%d rmc=%d "
          "anchor=%d stable=%d r=%ld commit=%lu age=%lu\n",
          clockStateLabel(work.clockState), work.ppsCount, work.ppsFresh ? 1 : 0,
          nmeaFresh ? 1 : 0, zdaFresh ? 1 : 0, rmcTimeFresh ? 1 : 0,
          localClock_.hasAnchor() ? 1 : 0, localClock_.ppsStable() ? 1 : 0,
          static_cast<long>(work.residualMs),
          static_cast<unsigned long>(commitEpoch_),
          static_cast<unsigned long>(work.ageMs == 0xFFFFFFFFu ? 0 : work.ageMs));
    }
  }
#endif

#if GPS_DEBUG
  const uint32_t now = millis();
  if (now - lastDebugMs_ >= 1000) {
    lastDebugMs_ = now;
    Serial.printf(
        "GPS fix=%d sat=%u pps=%u utc=%lu valid=%d clk=%s r=%ld ppm=%.1f q=%lu hold=%lu\n",
        work.validFix ? 1 : 0, work.satellites, work.ppsCount,
        static_cast<unsigned long>(work.utcEpoch), work.timeValid ? 1 : 0,
        clockStateLabel(work.clockState), static_cast<long>(work.residualMs),
        static_cast<double>(work.freqPpm), static_cast<unsigned long>(work.qualityMs),
        static_cast<unsigned long>(work.holdoverMs));
  }
#endif
}

