luweixuancl/esp32-gnss-ntp/src/gps_service.cpp
void GpsService::commitNmeaTime(uint32_t epochSec, AnomalyPolicy policy, uint16_t holdoverSec) {
  commitEpoch_ = epochSec;
  commitPpsCount_ = lastDrainedPpsCount_ != 0 ? lastDrainedPpsCount_ : ppsCount_;
  commitMs_ = millis();
  haveCommit_ = true;
  localClock_.onNmeaCommit(epochSec, commitPpsCount_, policy, holdoverSec);
}

void GpsService::publishStatus(const GpsStatus& work) {
  portENTER_CRITICAL(&mux_);
  published_ = work;
  portEXIT_CRITICAL(&mux_);
}

void GpsService::parseNmea() {
  int budget = GPS_NMEA_MAX_BYTES_PER_LOOP;
  while (budget-- > 0 && gpsSerial_.available() > 0) {
    const char c = static_cast<char>(gpsSerial_.read());
#if GPS_DEBUG_NMEA
    Serial.write(c);
#endif
    feedNmeaChar(c);
  }
}

GpsStatus GpsService::snapshot() const {
  GpsStatus out;
  portENTER_CRITICAL(&mux_);
  out = published_;
  portEXIT_CRITICAL(&mux_);
  return out;
}

bool GpsService::ppsFresh() const {
  uint64_t edge = 0;
  portENTER_CRITICAL(&ppsMux_);
  edge = ppsLastEdgeUs_;
  portEXIT_CRITICAL(&ppsMux_);
  if (edge == 0) {
    return false;
  }
  const uint64_t now = esp_timer_get_time();
  return (now >= edge) && ((now - edge) < 1500000ULL);
}

uint32_t GpsService::qualityMs() const {
  return localClock_.qualityMs();
}

bool GpsService::nowUtc(uint32_t& seconds, uint32_t& fraction) const {
  // NTP honesty: only LocalClock Locked/Degraded/Holdover may serve time.
  return localClock_.nowUtc(seconds, fraction);
}

bool GpsService::referenceUtc(uint32_t& seconds, uint32_t& fraction) const {
  return localClock_.referenceUtc(seconds, fraction);
}
